Autodesk.Revit.DB.Structure.RebarFreeFormCreationResult.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarFreeFormCreationResult.Rebar
Identifies the created Rebar. If the error code is Success, then it will be a valid rebar, otherwise it will be a null Rebar.
Since:
2026

Autodesk.Revit.DB.Structure.RebarFreeFormCreationResult.Error
Identifies the error that occurs during the operation. Will be Success if everything is ok, otherwise the failure reason.
Since:
2026

Autodesk.Revit.DB.Structure.RebarFreeFormCreationResult
Class that encapsulates the result of the rebar free form creation.
Since:
2026